jmeter-teastore/relatorio-complexo/statistics.json
{
  "GET Cart" : {
    "transaction" : "GET Cart",
    "sampleCount" : 10,
    "errorCount" : 10,
    "errorPct" : 100.0,
    "meanResTime" : 16.400000000000002,
    "medianResTime" : 15.0,
    "minResTime" : 15.0,
    "maxResTime" : 20.0,
    "pct1ResTime" : 20.0,
    "pct2ResTime" : 20.0,
    "pct3ResTime" : 20.0,
    "throughput" : 13.568521031207599,
    "receivedKBytesPerSec" : 129.74898236092267,
    "sentKBytesPerSec" : 2.014077340569878
  },
  "GET Product Earl Grey" : {
    "transaction" : "GET Product Earl Grey",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 38.2,
    "medianResTime" : 38.0,
    "minResTime" : 30.0,
    "maxResTime" : 46.0,
    "pct1ResTime" : 46.0,
    "pct2ResTime" : 46.0,
    "pct3ResTime" : 46.0,
    "throughput" : 6.561679790026247,
    "receivedKBytesPerSec" : 559.7100045111548,
    "sentKBytesPerSec" : 1.025262467191601
  },
  "GET Home" : {
    "transaction" : "GET Home",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 18.4,
    "medianResTime" : 17.0,
    "minResTime" : 11.0,
    "maxResTime" : 29.0,
    "pct1ResTime" : 29.0,
    "pct2ResTime" : 29.0,
    "pct3ResTime" : 29.0,
    "throughput" : 6.693440428380187,
    "receivedKBytesPerSec" : 59.60038068942436,
    "sentKBytesPerSec" : 0.967411311914324
  },
  "POST Add to Cart-1" : {
    "transaction" : "POST Add to Cart-1",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 15.2,
    "medianResTime" : 15.0,
    "minResTime" : 14.0,
    "maxResTime" : 17.0,
    "pct1ResTime" : 17.0,
    "pct2ResTime" : 17.0,
    "pct3ResTime" : 17.0,
    "throughput" : 6.7658998646820026,
    "receivedKBytesPerSec" : 64.69891745602165,
    "sentKBytesPerSec" : 1.0043132611637349
  },
  "POST Add to Cart-0" : {
    "transaction" : "POST Add to Cart-0",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 10.4,
    "medianResTime" : 10.0,
    "minResTime" : 9.0,
    "maxResTime" : 12.0,
    "pct1ResTime" : 12.0,
    "pct2ResTime" : 12.0,
    "pct3ResTime" : 12.0,
    "throughput" : 6.784260515603799,
    "receivedKBytesPerSec" : 5.220700474898236,
    "sentKBytesPerSec" : 1.8285702170963365
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 35,
    "errorCount" : 10,
    "errorPct" : 28.571428,
    "meanResTime" : 20.114285714285714,
    "medianResTime" : 17.0,
    "minResTime" : 9.0,
    "maxResTime" : 46.0,
    "pct1ResTime" : 36.8,
    "pct2ResTime" : 41.99999999999998,
    "pct3ResTime" : 46.0,
    "throughput" : 41.91616766467065,
    "receivedKBytesPerSec" : 802.3542758233533,
    "sentKBytesPerSec" : 8.584393712574851
  },
  "POST Add to Cart" : {
    "transaction" : "POST Add to Cart",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 25.8,
    "medianResTime" : 26.0,
    "minResTime" : 23.0,
    "maxResTime" : 29.0,
    "pct1ResTime" : 29.0,
    "pct2ResTime" : 29.0,
    "pct3ResTime" : 29.0,
    "throughput" : 6.657789613848202,
    "receivedKBytesPerSec" : 68.78849034620507,
    "sentKBytesPerSec" : 2.7827480026631157
  }
}